Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase.Size Property
 Gets or sets the size of the frame of the embedded object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Size Size { get; set; }
Public Property Size As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
EmbeddedObjectBase Class
Tekla.Structures.Drawing Namespace